Revit 2027 API
RelinquishOptions.FamilyWorksets Property
 True means all family worksets owned by the current user should be relinquished. False means none of these are relinquished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool FamilyWorksets { get; set; }
Public Property FamilyWorksets As Boolean
	Get
	Set
public:
property bool FamilyWorksets {
	bool get ();
	void set (bool value);
}
member FamilyWorksets : bool with get, set
Property Value
Boolean
See Also
Reference
RelinquishOptions Class
Autodesk.Revit.DB Namespace